import matplotlib.pyplot as plt

plt.subplot(221)
yy = [2.139312766163133e-08,2.4665715526872958e-08,2.709735884805587e-08,2.872444641053798e-08,]
y = [1/i for i in yy]
x = [1e-05,0.00034,0.00067,0.001,]
plt.plot(x, y, "o--", label='оптимизированный')
yy = [4.405995084273437e-09,1.2823628136617172e-08,1.4495284941045693e-08,1.53286208084421e-08,]
y = [1/i for i in yy]
plt.plot(x, y, "o--", label='распределенный')
plt.axis((0, 1e-3+1e-5, 0, 0.25*1e+9))
plt.ylabel('ops')
# plt.xlabel('вероятность')
plt.legend()
plt.title("pw")

plt.subplot(222)
yy = [1.2310029741152175e-08,2.2976233951707696e-08,2.628432874318576e-08,2.7412877927298027e-08,2.737746406299095e-08,2.7095365820283282e-08,2.7009856379995264e-08,2.6901829485583544e-08,2.6887487121055756e-08,2.6904494903482862e-08,2.7078687454658166e-08,2.740328974990095e-08,]
y = [1/i for i in yy]
x = [1,2,3,4,5,6,7,8,9,10,11,12,]
plt.plot(x, y, "o--", label='оптимизированный')
yy = [1.3110445557202624e-08,1.3509579211835151e-08,1.2023250968759569e-08,1.1544122008280392e-08,1.1381917838211396e-08,1.1180017521380766e-08,1.119014437866745e-08,1.125612617154815e-08,1.1299911380662934e-08,1.1431105364356652e-08,1.1554902131472843e-08,1.1679064378757268e-08,]
y = [1/i for i in yy]
plt.plot(x, y, "o--", label='распределенный')
plt.axis((0, 13, 0, 0.1*1e+9))
plt.ylabel('ops')
# plt.xlabel('вероятность')
plt.legend()
plt.title("procs")

plt.subplot(223)
yy = [2.5335390551624344e-08,2.542302016923253e-08,2.5505526615958082e-08,2.5616711110283198e-08,]
y = [1/i for i in yy]
x = [1,550,1100,1650,]
plt.plot(x, y, "o--", label='оптимизированный')
yy = [1.153835092993079e-08,1.1704483970051187e-08,1.1830571146792212e-08,1.1980122923604209e-08,]
y = [1/i for i in yy]
plt.plot(x, y, "o--", label='распределенный')
plt.axis((0, 1651, 0, 0.1*1e+9))
plt.ylabel('ops')
plt.xlabel('операции')
plt.legend()
plt.title("w")

plt.subplot(224)
yy = [2.5424891826424757e-08,2.4675292069203136e-08,2.5326718879713158e-08,2.6453745671757092e-08,]
y = [1/i for i in yy]
x = [1,4,7,10,]
plt.plot(x, y, "o--", label='оптимизированный')
yy = [1.1442968418165004e-08,1.1306895116887314e-08,1.1542277662360012e-08,1.2761387772966065e-08,]
y = [1/i for i in yy]
plt.plot(x, y, "o--", label='распределенный')
plt.axis((0, 11, 0, 0.1*1e+9))
plt.ylabel('ops')
plt.xlabel('операции')
plt.legend()
plt.title("r")

plt.show()
