import matplotlib.pyplot as plt

plt.subplot(221)
yy = [2.8868303336185522e-08,3.279064682659308e-08,3.78787077432331e-08,4.535402066118301e-08,]
y = [1/i for i in yy]
x = [0.001,0.034,0.067,0.1,]
plt.plot(x, y, "o--", label='оптимизированный')
yy = [1.4899866936252247e-08,3.6339481291434394e-08,5.2235008575417526e-08,6.841062028026346e-08,]
y = [1/i for i in yy]
plt.plot(x, y, "o--", label='распределенный')
plt.axis((0, 1e-1+1e-3, 0, 0.7*1e+8))
plt.ylabel('ops')
# plt.xlabel('вероятность')
plt.legend()
plt.title("pw")

plt.subplot(222)
yy = [2.2855877266145835e-08,3.4273187911718744e-08,3.420451692291666e-08,3.554288697395833e-08,3.6307504762083335e-08,3.6857619332378474e-08,3.752949766778274e-08,3.813001317636719e-08,3.879362738327546e-08,3.94035931021875e-08,4.0071719528030303e-08,4.0704991674739583e-08,]
y = [1/i for i in yy]
x = [1,2,3,4,5,6,7,8,9,10,11,12,]
plt.plot(x, y, "o--", label='оптимизированный')
yy = [3.3701180286458333e-08,4.5132163390885415e-08,4.072138444375e-08,4.1651874792187505e-08,4.3442264545729164e-08,4.3747881169357634e-08,4.4178771868154764e-08,4.421273131653646e-08,4.431284637581018e-08,4.456785046302083e-08,4.481331180980114e-08,4.5172670788411456e-08,]
y = [1/i for i in yy]
plt.plot(x, y, "o--", label='распределенный')
plt.axis((0, 13, 0, 0.475*1e+8))
plt.ylabel('ops')
# plt.xlabel('вероятность')
plt.legend()
plt.title("procs")

plt.subplot(223)
yy = [2.1355932191316272e-08,3.1606118522408374e-08,4.118469476026997e-08,5.0744933093200104e-08,]
y = [1/i for i in yy]
x = [1,550,1100,1650,]
plt.plot(x, y, "o--", label='оптимизированный')
yy = [2.9987969041180906e-08,3.865987445150474e-08,4.727403658774506e-08,5.596309700293692e-08,]
y = [1/i for i in yy]
plt.plot(x, y, "o--", label='распределенный')
plt.axis((0, 1651, 0, 0.5*1e+8))
plt.ylabel('ops')
plt.xlabel('операции')
plt.legend()
plt.title("w")

plt.subplot(224)
yy = [3.5420193127974344e-08,3.4927827685336754e-08,3.6118580338201534e-08,3.842507741568209e-08,]
y = [1/i for i in yy]
x = [1,4,7,10,]
plt.plot(x, y, "o--", label='оптимизированный')
yy = [4.2341493126319125e-08,4.2323716842139934e-08,4.268055032787332e-08,4.453921678703525e-08,]
y = [1/i for i in yy]
plt.plot(x, y, "o--", label='распределенный')
plt.axis((0, 11, 0, 0.3*1e+8))
plt.ylabel('ops')
plt.xlabel('операции')
plt.legend()
plt.title("r")

plt.show()
