import matplotlib.pyplot as plt

plt.subplot(221)
yy = [2.1404266915046824e-08,2.46723876010401e-08,2.7135718922506794e-08,2.8855571782521842e-08,]
y = [1/i for i in yy]
x = [1e-05,0.00034,0.00067,0.001,]
plt.plot(x, y, "o--", label='оптимизированный')
yy = [4.453656998584776e-09,1.2982003454553684e-08,1.4274340144638585e-08,1.491267307426068e-08,]
y = [1/i for i in yy]
plt.plot(x, y, "o--", label='распределенный')
plt.axis((0, 1e-3+1e-5, 0, 0.25*1e+9))
plt.ylabel('ops')
# plt.xlabel('вероятность')
plt.legend()
plt.title("pw")

plt.subplot(222)
yy = [1.1831341487343751e-08,2.3239856405104166e-08,2.6561297757222223e-08,2.7718482785234375e-08,2.7568567669437503e-08,2.72324093903559e-08,2.702306975612351e-08,2.6840427685572918e-08,2.6810768895381945e-08,2.686214991171875e-08,2.7099655481605117e-08,2.741580843824653e-08,]
y = [1/i for i in yy]
x = [1,2,3,4,5,6,7,8,9,10,11,12,]
plt.plot(x, y, "o--", label='оптимизированный')
yy = [1.2528535855937498e-08,1.3410083123229166e-08,1.192591934217014e-08,1.1394633921510416e-08,1.12682648533125e-08,1.1247571116458333e-08,1.1285348265223214e-08,1.133087044454427e-08,1.1316119666018517e-08,1.1291246538437499e-08,1.1404963094332385e-08,1.1464464794939236e-08,]
y = [1/i for i in yy]
plt.plot(x, y, "o--", label='распределенный')
plt.axis((0, 13, 0, 0.0925*1e+9))
plt.ylabel('ops')
# plt.xlabel('вероятность')
plt.legend()
plt.title("procs")

plt.subplot(223)
yy = [2.5395552689777764e-08,2.5470567383678136e-08,2.556188555120792e-08,2.563993959645174e-08,]
y = [1/i for i in yy]
x = [1,550,1100,1650,]
plt.plot(x, y, "o--", label='оптимизированный')
yy = [1.1424813264700507e-08,1.1592873877367698e-08,1.1741330864063077e-08,1.1863655665906446e-08,]
y = [1/i for i in yy]
plt.plot(x, y, "o--", label='распределенный')
plt.axis((0, 1651, 0, 0.0925*1e+9))
plt.ylabel('ops')
plt.xlabel('операции')
plt.legend()
plt.title("w")

plt.subplot(224)
yy = [2.5321036295630196e-08,2.4837881064847706e-08,2.5419136499131477e-08,2.648989136150618e-08,]
y = [1/i for i in yy]
x = [1,4,7,10,]
plt.plot(x, y, "o--", label='оптимизированный')
yy = [1.1368459648888866e-08,1.1168861326208926e-08,1.1442568687187335e-08,1.2642784009752603e-08,]
y = [1/i for i in yy]
plt.plot(x, y, "o--", label='распределенный')
plt.axis((0, 11, 0, 0.0925*1e+9))
plt.ylabel('ops')
plt.xlabel('операции')
plt.legend()
plt.title("r")

plt.show()
